cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'nmap'
brew 'tmux'
brew 'vim'
brew 'macvim'
brew 'neovim'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'iterm2'
cask 'adium'
cask 'atom'
cask 'visual-studio-code'
cask 'firefox'
cask 'google-chrome'
cask 'seashore'
cask 'slack'
cask 'transmit'
cask 'fantastical'
