cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/cask-fonts'
tap 'huytd/cask-fonts'
tap 'koekeishiya/formulae'
tap 'somdoron/formulae'

cask 'font-fira-code'
cask 'font-haskplex'
cask 'font-haskplex-nerd'
cask 'hyper'
cask 'sizeup'
cask 'istat-menus'
cask 'launchbar'
cask '1password'
cask '1password-cli'
cask 'dash'
cask 'sublime-text'
cask 'iterm2'
cask 'adium'
cask 'atom'
cask 'visual-studio-code'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmit'
cask 'fantastical'
cask 'xquartz'
cask 'paw'
cask 'fork'
cask 'kovidgoyal/kitty'

brew 'skhd'
brew 'yabai'
brew 'trash'
brew 'neofetch'
brew 'ranger'
brew 'fortune'
brew 'go'
brew 'nmap'
brew 'neofetch'
brew 'ag'
brew 'fzf'
brew 'tmux'
brew 'vim'
brew 'macvim'
brew 'neovim'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'readline'
brew 'tmuxinator'
